papo-config.org
** Languages

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-langs.el
  ;;; init-langs.el --- Programming Languages Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (add-to-list 'load-path (expand-file-name "lisp/languages" user-emacs-directory))

  (require 'init-ruby)
  (require 'init-dart)
  (require 'init-sql)

  (provide 'init-langs)
  ;;; init-langs.el ends here
#+end_src

*** Ruby

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-ruby.el
  ;;; init-ruby.el --- Ruby Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package inf-ruby
    :hook ((ruby-mode    . inf-ruby-minor-mode)
           (ruby-ts-mode . inf-ruby-minor-mode)))

  (use-package rvm
    :if (eq *rvm-installed* t)
    :after inf-ruby
    :config
    (advice-add 'inf-ruby-console-auto :before #'rvm-activate-corresponding-ruby))

  (use-package robe
    :hook ((ruby-mode    . robe-mode)
           (ruby-ts-mode . robe-mode))
    :config
    ;; (eval-after-load 'company
    ;;   '(push 'company-robe company-backends))
    )

  (use-package bundler
    :after ruby-mode)

  (use-package rspec-mode
    ;; :diminish rspec-mode
    :hook ruby-mode
    :config
    (setq rspec-use-rake-when-possible nil))

  (use-package yari
    :after ruby-mode
    :bind (:map ruby-mode-map
                ("C-c k" . yari)))

  (use-package rubocop
    :hook ((ruby-mode    . rubocop-mode)
           (ruby-ts-mode . rubocop-mode)))

  (provide 'init-ruby)
  ;;; init-ruby.el ends here
#+end_src

*** Dart

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-dart.el
  ;;; init-dart.el --- Dart Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package dart-mode
    :mode "\\.dart\\'"
    :bind (:map dart-mode-map
                ("C-c C-o" . dart-server-format)
                ("C-M-x"   . flutter-run-or-hot-reload)))

  (use-package dart-server
    :after dart-mode
    :hook (dart-server . flycheck-mode))

  (use-package flutter
    :after dart-mode
    :config
    (setq flutter-sdk-path "~/FlutterDev/flutter/"))

  (provide 'init-dart)
  ;;; init-dart.el ends here
#+end_src

*** Sql

#+begin_src elisp :tangle ~/.emacs.d/lisp/languages/init-sql.el
  ;;; init-sql.el --- Sql Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package sqlformat
    :bind (:map sql-mode-map
                ("C-c C-f" . sqlformat))
    :hook (sql-mode . sqlformat-on-save-mode)
    :config
    (setq sqlformat-command 'pgformatter
          sqlformat-args '("-s2" "-g")))

  (use-package sqlup-mode
    :bind (:map sql-mode-map
                ("C-c u" . sqlup-capitalize-keywords-in-region))
    :hook ((sql-mode . sqlup-mode)
           ;; Capitalize keywords in an interactive session (e.g. psql)
           (sql-interactive-mode . sqlup-mode))
    :config
    (add-to-list 'sqlup-blacklist "name"))

  (provide 'init-sql)
  ;;; init-sql.el ends here
#+end_src


** Miscellaneous

#+begin_src elisp :tangle ~/.emacs.d/lisp/init-misc.el
  ;;; init-misc.el --- Miscellaneous Packages Configuration ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:
  (add-to-list 'load-path (expand-file-name "lisp/miscellaneous" user-emacs-directory))

  (require 'init-docker)

  (provide 'init-misc)
  ;;; init-misc.el ends here
#+end_src

*** Docker

#+begin_src elisp :tangle ~/.emacs.d/lisp/miscellaneous/init-docker.el
  ;;; init-docker.el --- Better Emacs Docker ;; -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  (use-package docker)
  (use-package docker-compose-mode)
  (use-package dockerfile-mode
    :config
    (put 'dockerfile-image-name 'safe-local-variable #'stringp))

  (provide 'init-docker)
  ;;; init-docker.el ends here
#+end_src
